In [2]:
import sqlite3

In [ ]:
query = """
    create table sameer
    (a varchar(50),b varchar(50),
    c real,d integer);
"""

In [ ]:
print(query)

In [ ]:
con = sqlite3.connect("mydata.sqlite")

In [ ]:
con.execute(query)

In [ ]:
con.commit()

In [ ]:
con

In [ ]:
data = [('data', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]
smts = "insert into sameer values(?,?,?,?)"
con.executemany(smts,data)
con.commit()

In [ ]:
cursor = con.execute('select * from sameer')
rows = cursor.fetchall()
rows

In [22]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.DataFrame({'Sameer':['AK','Do','three','Four','Five','Six','Seven'],
                    'Abdullah':"KHan"}
)

In [4]:
import sqlite3

In [5]:
data

NameError: name 'data' is not defined

In [14]:
query2 = """
    CREATE TABLE Students
    (name varchar(50),father varchar(50),
    c varchar(50));

"""

In [17]:
con.execute(query2)

In [18]:
con = sqlite3.connect('mydata.sqlite')

In [19]:
con.commit()
con

In [20]:
details = [('Sameer','Younus','twelve'),
          ('Sameer','Younus','twelve')]
smt = "insert into Students values(?,?,?)"
con.executemany(smt,details)
con.commit()

In [21]:
cursor = con.execute('select * from Students')
rows = cursor.fetchall()
rows

[('Sameer', 'Younus', 'twelve'), ('Sameer', 'Younus', 'twelve')]

In [24]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

     name  father       c
0  Sameer  Younus  twelve
1  Sameer  Younus  twelve

In [26]:
import sqlalchemy as sqla

In [27]:
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from Students',db)

     name  father       c
0  Sameer  Younus  twelve
1  Sameer  Younus  twelve

In [29]:
for i in db:
    print(i)

TypeError: 'Engine' object is not iterable

In [30]:
dbs = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from Students',dbs)

     name  father       c
0  Sameer  Younus  twelve
1  Sameer  Younus  twelve